{
  "auto_mapping": null,
  "base_model_name_or_path": "google/paligemma2-3b-pt-224",
  "encoder_hidden_size": 1024,
  "inference_mode": true,
  "num_attention_heads": 4,
  "num_layers": 26,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 50,
  "peft_type": "PREFIX_TUNING",
  "prefix_projection": false,
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 1024
}